{"number": "HB1308", "url": "https://capitol.texas.gov/BillLookup/History.aspx?LegSess=89R&Bill=HB1308", "caption": "Relating to employment practices of governmental entities, state contractors, and private employers in this state regarding the legal status of employees, including requiring participation in the federal electronic verification of employment authorization program, or E-verify program, and authorizing the suspension of certain licenses held by private employers for certain conduct in relation to the employment of persons not lawfully present.", "authors": "Tepper", "last_action": "11/13/2024 H Filed", "summary": "<br>This bill requires all governmental entities and employers with 25+ employees in Texas to use E-verify for new hires and prohibits knowingly hiring unauthorized workers. Chinese immigrants who are lawfully admitted for permanent residence or authorized to work in the US are not impacted. However, Chinese nationals without proper work authorization could face employment restrictions. Violations can result in license suspensions for employers and loss of state grant funding for government entities.<br>", "translation": "<br>该法案要求德克萨斯州所有政府机构和拥有25名以上员工的雇主必须使用E-verify系统验证新雇员身份，并禁止故意雇用无授权工作者。合法永久居民或获得工作许可的中国移民不受影响。但是，没有适当工作许可的中国公民可能面临就业限制。违规的雇主可能被吊销执照，违规的政府机构可能失去州政府拨款。<br>", "committees": "<br>1. State Affairs Committee<br>2. Business  Industry Committee <br>3. Licensing  Administrative Procedures Committee<br>"}