{"number": "HB2038", "url": "https://capitol.texas.gov/BillLookup/History.aspx?LegSess=89R&Bill=HB2038", "caption": "Relating to the issuance by the Texas Medical Board of certain licenses to practice medicine and the authority of an insured to select certain license holders under the insured's health policy; requiring an occupational license; authorizing fees.", "authors": "Oliverson", "last_action": "01/23/2025 H Filed", "summary": "<br>This bill establishes a pathway for foreign-trained physicians, including Chinese doctors, to practice medicine in Texas through a provisional license system. Foreign medical graduates who have been licensed and practiced in their home countries for 5-10 years can work under supervision of a board-certified physician. The bill affects Chinese medical professionals by allowing them to practice in Texas if they meet English proficiency, licensing exam, and other requirements. However, they must work under supervision and disclose their graduate status to patients.<br>", "translation": "<br>该法案为包括中国医生在内的外国培训医生在德克萨斯州执业建立了一个临时执照系统。在其母国获得执照并执业5-10年的外国医学毕业生可以在委员会认证医生的监督下工作。该法案允许符合英语水平、执照考试和其他要求的中国医疗专业人员在德克萨斯州执业。但是，他们必须在监督下工作，并向患者披露其毕业生身份。<br>", "committees": "<br>1. House Committee on Public Health<br>2. House Committee on Higher Education<br>3. House Committee on Licensing  Administrative Procedures<br>", "category": "Immigration"}