{"number": "HB3681", "url": "https://capitol.texas.gov/BillLookup/History.aspx?LegSess=89R&Bill=HB3681", "caption": "Relating to requiring certain public and private employers in this state to participate in the federal electronic verification of employment authorization program, or E-verify, and notice regarding certain persons whose eligibility to work in the United States cannot be verified; creating a criminal offense.", "authors": "Lowe", "last_action": "03/04/2025 H Filed", "summary": "<br>This bill requires all public and private employers in Texas to use E-verify to verify employment eligibility of new hires. If E-verify cannot confirm a person's legal status, employers must report to Department of Public Safety within 5 days. DPS will then determine if the person may be unlawfully present and notify ICE. While not specifically targeting Chinese immigrants, this affects all non-citizens including Chinese nationals seeking employment in Texas. Violations are Class A misdemeanors.<br>", "translation": "<br>该法案要求德克萨斯州所有公共和私营雇主使用E-verify系统验证新雇员的就业资格。如果E-verify无法确认某人的合法身份，雇主必须在5天内向公共安全部报告。公共安全部将确定该人是否可能非法居留，并通知移民及海关执法局。虽然并非专门针对中国移民，但这项法案会影响包括在德州求职的中国公民在内的所有非公民。违反该法案将构成A级轻罪。<br>", "committees": "<br>1. State Affairs Committee<br>2. Labor Committee<br>3. Public Safety Committee<br>", "category": "Immigration"}