{"number": "HB4597", "url": "https://capitol.texas.gov/BillLookup/History.aspx?LegSess=89R&Bill=HB4597", "caption": "Relating to interests in real property held or acquired by or on behalf of certain foreign individuals or entities and the authority of the attorney general to acquire the property by eminent domain; establishing the homeland security review committee; creating a criminal offense.", "authors": "Cain", "last_action": "03/12/2025 H Filed", "summary": "<br>This bill restricts real property ownership by individuals and entities from foreign adversary countries, including China. It prohibits Chinese nationals (non-US citizens/permanent residents) from acquiring agricultural land, property near critical infrastructure (within 25 miles), commercial property, and multi-family housing. Properties owned before Sept 2025 are grandfathered. The bill creates a homeland security review committee to approve/disapprove transactions and allows the state to acquire restricted properties through eminent domain.<br>", "translation": "<br>该法案限制来自外国对手国家（包括中国）的个人和实体拥有房地产。它禁止中国公民（非美国公民/永久居民）购买农业用地、靠近关键基础设施（25英里内）的房产、商业地产和多户住房。2025年9月前已拥有的房产可以保留。该法案成立国土安全审查委员会来批准/否决交易，并允许州政府通过征用权获取受限制的房产。<br>", "committees": "<br>1. State Affairs Committee<br>2. Land  Resource Management Committee<br>3. Homeland Security  Public Safety Committee<br>", "category": "Alien land laws"}