{"number": "SB2514", "url": "https://capitol.texas.gov/BillLookup/History.aspx?LegSess=89R&Bill=SB2514", "caption": "Relating to establishing the hostile foreign adversaries unit at the Department of Public Safety and training, prohibitions, and reporting requirements designed to combat foreign influence and foreign adversary operations; creating a criminal offense.", "authors": "Hughes", "last_action": "05/07/2025 H Referred to Homeland Security, Public Safety & Veterans' Affairs: May  7 2025  5:42PM", "summary": "<br>This bill establishes a hostile foreign adversaries unit at DPS to combat foreign influence operations. It specifically mentions Chinese Communist Party's United Front Work Department. State/local employees must report interactions with foreign adversaries and cannot accept gifts/travel from them. Chinese nationals and Chinese Americans may face increased scrutiny in their interactions with government employees, potentially affecting their ability to engage in normal business or academic collaborations.<br>", "translation": "<br>该法案在德克萨斯公共安全部设立敌对外国势力部门，以打击外国影响力行动。法案特别提到中国共产党统战部。州/地方政府雇员必须报告与外国对手的互动，且不得接受他们的礼物/旅行。这可能导致在美华人和中国公民在与政府雇员的正常互动中面临更严格的审查，可能影响他们进行正常的商业或学术合作的能力。<br>", "committees": "<br>1. Homeland Security  Public Safety Committee<br>2. State Affairs Committee<br>3. International Relations  Economic Development Committee<br>", "category": "Others"}