{"english": "\nAlien land laws have historically been used to restrict property ownership by non-citizens, often with discriminatory intent. The current set of Texas bills represents a modern version of these restrictive policies, particularly targeting Chinese interests and nationals.\n\nThese bills create a comprehensive framework of restrictions on property ownership:\n\n1. Direct Prohibitions on Property Purchase:\n- Multiple bills (HB191, HB402, HB1566, HB1849, SB103, SB307) explicitly prohibit property purchases by entities from \"designated countries,\" with China consistently named as a target.\n- These restrictions affect Chinese government entities, organizations headquartered in China, and in some cases, individual Chinese nationals.\n\n2. Agricultural Land Restrictions:\n- HB518 and HB1743 specifically target agricultural land ownership, forcing Chinese nationals who are not Texas residents to divest their holdings by 2027.\n- HB546 increases the tax burden on foreign-owned agricultural land by making it ineligible for open-space tax benefits.\n\n3. Infrastructure and Resource Protection:\n- HB243 enables property seizure near critical infrastructure, potentially affecting Chinese-owned properties.\n- HB2034 restricts groundwater permits for Chinese entities and nationals.\n\n4. Documentation and Verification Requirements:\n- HB733 adds burdensome documentation requirements for property transactions involving non-citizens, including Chinese immigrants.\n\nThe discriminatory nature of these bills is evident in their targeted approach toward specific nationalities, particularly Chinese. While some bills exempt U.S. citizens and permanent residents of Chinese descent, they create significant barriers for Chinese nationals legally residing in the U.S. on temporary visas, Chinese businesses, and investors. The cumulative effect could lead to:\n- Forced property divestiture\n- Criminal penalties and substantial fines\n- Increased difficulty in conducting business\n- Higher tax burdens\n- Limited access to natural resources\n- Creation of a hostile environment for Chinese immigrants and investors\n", "chinese": "\n外国人土地法历来被用于限制非公民的房地产所有权，往往带有歧视性意图。目前这些德克萨斯州的法案代表了这些限制性政策的现代版本，特别针对中国利益和中国公民。\n\n这些法案创建了一个全面的产权限制框架：\n\n1. 直接禁止购买房地产：\n- 多项法案(HB191、HB402、HB1566、HB1849、SB103、SB307)明确禁止来自\"指定国家\"的实体购买房地产，其中中国被持续点名。\n- 这些限制影响中国政府实体、总部设在中国的组织，在某些情况下还包括中国公民个人。\n\n2. 农业用地限制：\n- HB518和HB1743特别针对农业用地所有权，强制非德州居民的中国公民在2027年前出售其持有的土地。\n- HB546通过取消外国人拥有的农业用地的开放空间税收优惠，增加了其税收负担。\n\n3. 基础设施和资源保护：\n- HB243允许没收靠近关键基础设施的房产，可能影响中国人拥有的房产。\n- HB2034限制中国实体和公民获取地下水许可。\n\n4. 文件和验证要求：\n- HB733为非公民（包括中国移民）的房地产交易增加了繁重的文件要求。\n\n这些法案的歧视性质体现在它们针对特定国籍，特别是中国人的做法上。虽然一些法案豁免了华裔美国公民和永久居民，但它们为持临时签证的中国公民、中国企业和投资者设置了重大障碍。累积效应可能导致：\n- 被迫出售房产\n- 刑事处罚和巨额罚款\n- 经商难度增加\n- 更高的税收负担\n- 获取自然资源受限\n- 为中国移民和投资者营造敌对环境\n"}