{"english": "\nAlien land laws historically have been used to restrict property ownership by non-citizens, often targeting specific ethnic or national groups. This set of Texas bills represents a modern iteration of discriminatory land laws, primarily targeting Chinese nationals and entities, along with some other designated countries.\n\nThe bills can be categorized into several key restrictions:\n\n1. Broad Property Ownership Restrictions:\n- Multiple bills (HB191, HB402, HB1566, HB1849, HB2389, HB2536, SB103) explicitly prohibit Chinese citizens, government entities, and Chinese-controlled organizations from purchasing real property in Texas, unless they are US citizens or permanent residents.\n- HB2628 and HB2752 take a broader approach by targeting foreign organizations and entities from \"designated countries.\"\n\n2. Agricultural Land Specific:\n- HB518, HB1743, and SB1063 specifically restrict foreign ownership of agricultural land, with SB1063 focusing on parcels up to 5 acres.\n- HB546 affects tax benefits for foreign-owned agricultural and open-space land.\n\n3. Enhanced Enforcement Mechanisms:\n- HB243 grants the Texas Attorney General power to seize foreign-owned property near critical infrastructure.\n- HB733 implements strict verification requirements for residential property transactions.\n- HB2034 restricts groundwater permits for entities from designated countries.\n\nThe discriminatory impact on Chinese individuals and entities is severe:\n- Chinese nationals without permanent residency will be forced to divest existing properties by specific dates (e.g., 2027 under HB1743)\n- Chinese businesses face complete prohibition from property ownership\n- Even Chinese permanent residents may face additional scrutiny and documentation requirements\n- Chinese agricultural investments will be particularly affected\n- Criminal penalties and forced divestitures create significant legal risks\n\nThese bills collectively create a hostile environment for Chinese investment and property ownership in Texas, potentially affecting even legitimate business operations and individual property rights of Chinese immigrants and Chinese Americans.\n\n", "chinese": "\n外国人土地法历来被用于限制非公民的房地产所有权，通常针对特定的族裔或国籍群体。这套德克萨斯州法案代表了歧视性土地法的现代版本，主要针对中国公民和实体，以及其他一些特定国家。\n\n这些法案可分为几个主要限制类别：\n\n1. 广泛的产权限制：\n- 多项法案（HB191、HB402、HB1566、HB1849、HB2389、HB2536、SB103）明确禁止中国公民、政府实体和中国控制的组织在德克萨斯购买房地产，除非他们是美国公民或永久居民。\n- HB2628和HB2752采取更广泛的方式，针对来自\"指定国家\"的外国组织和实体。\n\n2. 农业用地特定限制：\n- HB518、HB1743和SB1063专门限制外国人拥有农业用地，其中SB1063侧重于5英亩以下的地块。\n- HB546影响外国人拥有的农业和开放空间用地的税收优惠。\n\n3. 加强执法机制：\n- HB243授权德克萨斯州总检察长没收靠近关键基础设施的外国人拥有的财产。\n- HB733对住宅物业交易实施严格的验证要求。\n- HB2034限制指定国家实体的地下水许可证。\n\n对中国个人和实体的歧视性影响是严重的：\n- 没有永久居留权的中国公民将被迫在特定日期前（如HB1743规定的2027年）出售现有财产\n- 中国企业完全被禁止拥有房地产\n- 即使是中国永久居民也可能面临额外审查和文件要求\n- 中国农业投资将受到特别影响\n- 刑事处罚和强制剥离造成重大法律风险\n\n这些法案共同为中国在德克萨斯州的投资和房地产所有权创造了一个敌对环境，可能影响到中国移民和华裔美国人的合法商业运营和个人产权。\n"}