{"english": "\nAlien land laws historically have been discriminatory measures used to restrict property ownership rights of specific ethnic or national groups. This set of Texas bills represents a modern iteration of such discriminatory legislation, primarily targeting Chinese nationals and entities, along with some other designated countries.\n\nThese bills create a comprehensive framework of restrictions that significantly impact Chinese individuals and entities in Texas:\n\nProperty Purchase Restrictions:\n- Multiple bills (HB191, HB402, HB1566, HB1849, HB2389, HB2536, HB2752, SB17, SB103, SB307) explicitly prohibit Chinese nationals, government entities, and Chinese-controlled organizations from purchasing real property in Texas.\n- Agricultural land faces particular scrutiny, with HB518, HB1743, SB1063 specifically restricting foreign ownership of farmland, with SB1063 specifically addressing land up to 5 acres.\n\nEnforcement and Penalties:\n- HB243 authorizes property seizure through eminent domain near critical infrastructure.\n- HB733 requires citizenship verification for residential property purchases.\n- Bills like HB1849 impose severe penalties, including criminal charges and fines up to $250,000 or 50% of property value.\n\nAdditional Restrictions:\n- HB546 affects tax benefits for foreign-owned open-space land.\n- HB2034 restricts groundwater permits for entities from designated countries.\n- HB2628 requires existing foreign-owned properties to be divested by March 1, 2026.\n- HB1743 forces non-resident Chinese citizens to divest their property by 2027.\n- HB2389 and SB103 additionally prohibit Chinese entities from entering contracts with Texas government entities.\n\nWhile many bills exempt U.S. citizens and permanent residents of Chinese descent, these laws create a hostile environment for Chinese nationals, students, and temporary workers in Texas. The legislation could affect:\n- Chinese students' housing options\n- Chinese businesses' operations and government contracts\n- Chinese professionals on work visas\n- Chinese agricultural investments\n- Property values of existing Chinese-owned properties\n- Access to groundwater rights\n- Tax burden on agricultural and open-space land\n\nThis legislative package represents a discriminatory approach that could lead to broader anti-Chinese sentiment and affect the Chinese-American community, even those exempt from these restrictions.\n", "chinese": "\n外国人土地法历来是一种歧视性措施，用于限制特定族裔或国籍群体的财产所有权。这套德克萨斯州法案代表了此类歧视性立法的现代版本，主要针对中国公民和实体，以及其他一些指定国家。\n\n这些法案创建了一个全面的限制框架，严重影响在德克萨斯州的中国个人和实体：\n\n房地产购买限制：\n- 多项法案(HB191, HB402, HB1566, HB1849, HB2389, HB2536, HB2752, SB17, SB103, SB307)明确禁止中国公民、政府实体和中国控制的组织在德克萨斯州购买房地产。\n- 农业用地受到特别审查，HB518、HB1743、SB1063特别限制外国人拥有农田，其中SB1063具体针对不超过5英亩的土地。\n\n执法和处罚：\n- HB243授权通过征用权没收关键基础设施附近的房产。\n- HB733要求验证购买住宅房产者的公民身份。\n- 如HB1849等法案规定严厉处罚，包括刑事指控和高达25万美元或房产价值50%的罚款。\n\n额外限制：\n- HB546影响外国人拥有的开放空间用地的税收优惠。\n- HB2034限制来自指定国家的实体获取地下水许可。\n- HB2628要求现有外国人拥有的房产必须在2026年3月1日前出售。\n- HB1743强制非居民中国公民在2027年前出售其房产。\n- HB2389和SB103还禁止中国实体与德克萨斯州政府实体签订合同。\n\n虽然许多法案豁免了具有中国血统的美国公民和永久居民，但这些法律为在德克萨斯州的中国公民、学生和临时工作者创造了一个敌对环境。这些立法可能影响：\n- 中国留学生的住房选择\n- 中国企业的运营和政府合同\n- 持工作签证的中国专业人士\n- 中国在农业领域的投资\n- 现有中国人拥有房产的价值\n- 地下水权限的获取\n- 农业和开放空间用地的税收负担\n\n这套立法方案代表了一种歧视性做法，可能导致更广泛的反华情绪，并影响中美社区，即使是那些被豁免的人群。\n"}