{"english": "\nImmigration laws typically focus on regulating entry, residence, and access to public services for non-citizens. These Texas bills represent restrictive measures that affect all unauthorized immigrants, including those from China.\n\nHB1762 creates a more punitive criminal justice environment for unauthorized immigrants by eliminating alternatives to incarceration like probation or deferred adjudication. This could severely impact Chinese nationals who have overstayed visas or entered without inspection, forcing them to face full sentences without access to rehabilitation programs or community supervision options.\n\nHB2587 implements a healthcare tracking system that requires hospitals to document immigration status and report costs associated with treating unauthorized immigrants. This could create barriers to healthcare access for Chinese immigrants without legal status, as they may fear seeking medical treatment due to mandatory reporting requirements. The bill could also contribute to discrimination and profiling in healthcare settings.\n\nBoth bills represent an increasingly restrictive approach to immigration enforcement that, while not explicitly targeting Chinese immigrants, creates additional hardships for Chinese nationals who lack proper immigration status. The measures could lead to increased detention rates, reduced access to essential healthcare services, and heightened fear within immigrant communities.\n", "chinese": "\n移民法通常侧重于管理非公民的入境、居留和获取公共服务。这些德克萨斯州的法案代表了影响所有非法移民（包括来自中国的移民）的限制性措施。\n\nHB1762通过取消缓刑或延期判决等替代监禁方式，为非法移民创造了更具惩罚性的刑事司法环境。这可能会严重影响签证逾期或未经检查入境的中国公民，迫使他们面临完整刑期，无法获得康复计划或社区监督选择。\n\nHB2587实施了一个医疗保健追踪系统，要求医院记录移民身份并报告与治疗非法移民相关的费用。这可能会为没有合法身份的中国移民设置医疗保健准入障碍，因为他们可能因强制报告要求而害怕寻求医疗治疗。该法案还可能导致医疗保健环境中的歧视和筛查。\n\n这两项法案代表了日益严格的移民执法方式，虽然没有明确针对中国移民，但为缺乏适当移民身份的中国公民制造了额外的困难。这些措施可能导致拘留率上升、基本医疗保健服务的获取减少，以及移民社区恐惧感的增加。\n"}