{"english": "\nImmigration legislation typically focuses on regulating the entry, residence, and rights of non-citizens within a jurisdiction. These Texas bills represent a broader trend of increasing restrictions on undocumented immigrants' access to public services and legal protections.\n\nHB1762 creates a more punitive criminal justice environment for undocumented immigrants by eliminating alternatives to incarceration. This would directly impact Chinese nationals who have overstayed their visas or entered without inspection, forcing them to face full sentences without the possibility of probation or deferred adjudication. This could be particularly concerning for Chinese students or workers who may have inadvertently fallen out of status.\n\nHB2587 introduces a healthcare tracking system that could create barriers to medical care access for undocumented immigrants, including Chinese nationals. By requiring hospitals to document immigration status, this bill may discourage unauthorized Chinese immigrants from seeking necessary medical care due to fear of detection or reporting. The data collection requirement could also contribute to discrimination and profiling of Asian patients in healthcare settings.\n\nBoth bills, while not explicitly targeting Chinese immigrants, could disproportionately affect vulnerable members of the Chinese community in Texas, particularly those who have fallen out of status or are awaiting adjustment of their immigration status. These measures could create additional barriers to accessing essential services and legal protections for Chinese immigrants.\n", "chinese": "\n移民立法通常侧重于规范非公民在特定管辖区内的入境、居留和权利。这些德克萨斯州的法案代表了一个更广泛的趋势，即加强对无证移民获取公共服务和法律保护的限制。\n\nHB1762通过取消监禁替代方案，为无证移民创造了一个更具惩罚性的刑事司法环境。这将直接影响签证逾期或未经检查入境的中国公民，迫使他们面临完整刑期，而没有缓刑或延期裁决的可能性。这对可能无意中失去合法身份的中国留学生或工作者来说尤其令人担忧。\n\nHB2587引入了一个医疗保健追踪系统，可能会为无证移民（包括中国公民）获取医疗服务设置障碍。通过要求医院记录移民身份，这项法案可能会因担心被发现或举报而阻止无证中国移民寻求必要的医疗护理。数据收集要求还可能导致医疗环境中对亚裔患者的歧视和刻板印象。\n\n这两项法案虽然没有明确针对中国移民，但可能会对德克萨斯州中国社区中的弱势群体造成不成比例的影响，特别是那些已经失去合法身份或正在等待调整移民身份的人。这些措施可能会为中国移民获取基本服务和法律保护设置额外障碍。\n"}