{"english": "\nImmigration laws typically focus on regulating the entry, residence, and rights of non-citizens within a jurisdiction. The three Texas bills presented here introduce various measures affecting immigrants, including those from China, ranging from employment verification to citizenship restrictions.\n\nKey impacts of these bills include:\n\n- Employment Restrictions: HB3681 maintains strict employment verification requirements by mandating all Texas employers to use E-verify for new hires. For Chinese workers, this creates additional scrutiny during hiring, with employers required to report unverified cases to authorities within 5 days, potentially leading to increased ICE involvement.\n\n- Financial Burden: HB4364 imposes a 5% fee on international money transfers, directly affecting Chinese residents sending remittances to family in China. This creates additional financial strain while funding border security measures, effectively making Chinese immigrants pay more for supporting their families back home.\n\n- Citizenship Restrictions: HB4771 presents a significant challenge to birthright citizenship, denying US citizenship to Texas-born children unless at least one parent is a US citizen, national, or legal permanent resident. This particularly impacts Chinese immigrants on temporary visas, such as students or H-1B workers, whose children would be denied citizenship despite being born in Texas.\n\nThese bills collectively create a more restrictive environment for immigrants, with particular implications for Chinese nationals through increased monitoring, financial burdens, and limitations on fundamental rights. The combination of employment verification requirements, financial penalties on remittances, and restrictions on birthright citizenship could significantly impact the Chinese community's ability to work, support family members, and secure their children's future in Texas.\n", "chinese": "\n移民法通常侧重于规范非公民在特定管辖区内的入境、居留和权利。这三项德克萨斯州法案针对包括中国移民在内的所有移民提出了各种管制措施，涉及从就业验证到公民身份限制等多个方面。\n\n这些法案的主要影响包括：\n\n- 就业限制：HB3681要求所有德克萨斯州雇主必须使用E-verify系统验证新雇员的就业资格。对中国工人来说，这将在招聘过程中带来额外审查，雇主必须在5天内向当局报告未经验证的案例，可能导致移民及海关执法局（ICE）的介入。\n\n- 经济负担：HB4364对国际汇款征收5%的费用，直接影响向中国家人汇款的中国居民。这不仅增加了经济负担，同时这些费用将用于资助边境安全措施，实际上让中国移民在支持国内家人时需付出更多成本。\n\n- 公民身份限制：HB4771对出生公民权提出重大挑战，除非父母中至少一方是美国公民、国民或合法永久居民，否则在德克萨斯州出生的儿童将被拒绝美国公民身份。这特别影响持临时签证的中国移民，如留学生或H-1B工作签证持有者，他们在德州出生的子女将无法获得公民身份。\n\n这些法案共同营造了一个对移民更具限制性的环境，通过加强监管、增加经济负担和限制基本权利，对中国公民产生特殊影响。就业验证要求、汇款惩罚性收费以及出生公民权限制的综合效应，可能会显著影响中国社区在德克萨斯州工作、支持家庭成员和保障子女未来的能力。\n"}