{"english": "\nImmigration laws typically focus on regulating entry, residence, and access to public services for non-citizens. These Texas bills represent a heightened focus on restricting services and tracking unauthorized immigrants.\n\nHB1762 creates a more punitive criminal justice environment for unauthorized immigrants by eliminating alternatives to incarceration. This would directly impact Chinese nationals who have overstayed visas or entered without inspection, forcing them to face full sentences without the possibility of probation or deferred adjudication. This could be particularly harsh for Chinese students or workers who may have inadvertently fallen out of status.\n\nHB2587 implements a healthcare tracking system that could deter unauthorized immigrants, including Chinese nationals, from seeking necessary medical care due to fear of being reported. The requirement for hospitals to collect immigration status information could create barriers to healthcare access and potentially lead to discrimination. Chinese immigrants without proper documentation may avoid seeking medical treatment, leading to worse health outcomes and public health concerns.\n\nBoth bills contribute to an increasingly hostile environment for unauthorized immigrants, with Chinese nationals who are out of status facing increased risks of incarceration and reduced access to healthcare services. Even legal Chinese residents might face increased scrutiny or discrimination due to these measures.\n", "chinese": "\n移民法通常侧重于管理非公民的入境、居留和获取公共服务。这些德克萨斯州的法案体现了对限制服务和追踪非法移民的加强关注。\n\nHB1762通过取消监禁替代方案，为非法移民创造了更严厉的刑事司法环境。这将直接影响签证过期或未经检查入境的中国公民，迫使他们面临完整刑期，而没有缓刑或延期裁决的可能性。这对可能无意中失去合法身份的中国留学生或工作人员来说特别严厉。\n\nHB2587实施的医疗保健追踪系统可能会因担心被举报而阻止非法移民（包括中国公民）寻求必要的医疗护理。要求医院收集移民身份信息可能会造成获取医疗保健的障碍，并可能导致歧视。没有适当文件的中国移民可能会避免寻求医疗治疗，导致更糟糕的健康结果和公共卫生问题。\n\n这两项法案都加剧了对非法移民的敌对环境，失去合法身份的中国公民面临着更高的入狱风险和更少的医疗保健服务机会。即使是合法的中国居民也可能因这些措施而面临更多的审查或歧视。\n"}